Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ཙ་ཤའི་ཚོགས་རྣམས་འདི་དག་ནམ་མཁར་སོང་སྟེ་ཁྱེད་ལ་སྐོར་བ་དང་། །
en: Just like flocks of Indian rollers that come and wheel around in the sky,

source: ལྷར་བཅས་མིར་བཅས་འཇིག་རྟེན་དག་ཀྱང་མཆོད་པར་བརྩོན་པར་གནས་པ་ལས། །
en: This world, too, with its gods and humans stands intent on worshiping you,

source: དེ་རིང་འགྲོ་བའི་སྦྱིན་གནས་འགྱུར་ཞིང་ཤེས་རབ་འདོད་པའི་ལམ་དུ་འགྱུར། །
en: For today you become a true path for seekers of wisdom, worthy of the world’s veneration.

source: བདེ་བར་གཤེགས་པ་བདག་གིས་རྙེད་པ་ལེགས་རྙེད་གཟི་བརྗིད་ཆེ་ལྡན་པ། །
en: “ ‘ “One can acquire no wealth greater than what we have found here, Swift One.

source: མི་མཆོག་འཁོར་བ་འཇིག་དང་དེ་བཞིན་གསེར་ཐུབ་ཅེས་ནི་བྱ་བ་མཆོད། །
en: Indeed, I have worshiped Krakucchanda, and the other preeminent sage named Kanaka.

source: མི་མཆོག་འོད་སྲུང་དང་ནི་ཤཱཀྱ་མཆོག་ཁྱོད་དེ་རིང་བདག་གིས་མཆོད། །
en: I honored the best of conquerors, Kāśyapa, and today also the great bull of the Śākyas.

source: བདག་ནི་སངས་རྒྱས་དཔའ་མཐོང་མ་བྲལ་བྱང་ཆུབ་དམ་པ་དོན་དུ་གཉེར། །
en: Aspiring for the state of the all-knowing, I have never been deprived of seeing the sages. “ ‘ “Release your lion’s roar, O Sage, its resonance pleasant like the sound of holy water,

source: ས་ནི་གྲུམ་ཞིང་རི་རྣམས་གཡོས་ལ་འགྲོ་བ་ཐམས་ཅད་མེད་འགྱུར་སྲིད། །
en: So that your speech will ever shake the earth and its tall mountains, our whole world.

source: སུ་ཞིག་བྱང་ཆུབ་ཏུ་ནི་སེམས་ངེས་ལྷག་པའི་བསམ་པས་འཕགས་གྱུར་པ། །
en: For one whose mind is fixed upon awakening and is uplifted by this ambition even now,

source: དེ་ནི་དེ་རིང་སྟོབས་བཅུ་ལྡན་པར་མི་འགྱུར་གནས་ནི་མཆིས་མ་ལགས། །
en: It is not possible that such a being could be stayed from coming to possess the ten powers.” ’

source: སེང་གེའི་སྒྲ་བསྒྲགས་ཚངས་པའི་དབྱངས་ཅན་བཅོམ་ལྡན་འདྲེན་པ་གསུང་ཕྱུང་ཤིག །ཞི་བའི་བློ་གྲོས་དེ་ནས་ཀླུའི་རྒྱལ་པོ་ནག་པོའི་ཆུང་མ་དམ་པ་གསེར་འོད་ཅེས་བྱ་བ་དེ་ཀླུའི་བུ་མོ་རབ་ཏུ་མང་པོས་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་གདུགས་སྣ་ཚོགས་ཐོགས་པ་དང་། རས་བཅོས་བུ་སྣ་ཚོགས་ཐོགས་པ་དང་།
en: “At that point, Śāntamati, the chief queen of the nāga king Kālika, whose name was Suvarṇaprabhāsā, came forward surrounded by many nāga girls.

source: མུ་ཏིག་གི་རྒྱན་ཕྲེང་སྣ་ཚོགས་ཐོགས་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐོགས་པ་དང་། ལྷའི་དང་མིའི་ཕྲེང་བ་བརྒྱུས་པ་ཐོགས་པ་དང་། པོག་པོར་སྣ་ཚོགས་ཐོགས་པ་དང་། སིལ་སྙན་དང་།
en: They were holding many parasols, they were holding many cotton cloths, they were holding many pearl necklaces, they were holding many precious jewels, they were holding many high-quality garlands made by gods and humans, they were holding many bowls of incense, and they were playing many cymbals and other musical instruments.

source: རོལ་མོའི་སྒྲ་སྣ་ཚོགས་ལེན་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འོང་བ་ལ་འཐོར་ཞིང་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: They scattered many jeweled flowers on the path on which the Bodhisattva was walking, and they praised him with these verses: “ ‘To you who are not bewildered;

source: འཁྲུལ་པ་མི་མངའ་མི་དངང་མི་བསྙེངས་བག་མི་ཚ། །
en: to you who have no trembling, no fears, no frights;

source: མ་ཞུམ་མི་དམན་རབ་དགྱེས་མི་ཐུབ་ཆགས་མི་མངའ། །
en: To you who are not dismayed or dispirited, joyful, unyielding, dispassionate;

source: སྡང་དང་རྨོངས་དང་བརྐམ་པ་མི་མངའ་ཆགས་བྲལ་བ། །
en: To you who have no anger, no ignorance, no lust; to you who are free of craving;

source: རྣམ་གྲོལ་དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: To you who have become liberated—to you, Great Seer, we pay homage!

source: དོགས་བྲལ་ཟུག་རྔུ་བྲལ་ཞིང་དུལ་ལ་མ་རིག་སེལ། །
en: “ ‘You are a physician who removes the dart, a leader of those who are led;

source: འགྲོ་བ་ཐམས་ཅད་སྡུག་བསྔལ་རྣམས་ལས་རབ་ཏུ་འགྲེལ། །
en: Truly learned doctor, you free beings from their sufferings.

source: གནས་དང་སྐྱབས་དང་གླིང་མ་མཆིས་པ་མཁྱེན་ནས་ནི། །
en: Recognizing those who are without sanctuary, refuge, or shelter,

source: གནས་ཁྱོད་སྐྱབས་ཁྱོད་འཇིག་རྟེན་གསུམ་པོ་དག་ཏུ་བྱུང་། །
en: You, a sanctuary, you, a refuge—you have arisen in the three worlds.

source: ཇི་ལྟར་ལྷ་ཡི་ཚོགས་རྣམས་དད་ཅིང་རབ་དགའ་སྟེ། །
en: “ ‘Just as congregations of gods, faithful and delighted,

source: མཁའ་ལས་མེ་ཏོག་ཆར་ཆེན་རབ་ཏུ་འབེབས་པ་དང་། །
en: Rain down great showers of flowers from the sky

source: ཇི་ལྟར་གོས་ཆེན་དག་ཀྱང་འདོར་བར་བགྱིད་ལགས་ན། །
en: And cast down great bolts of cloth, Great Seer,

source: དྲང་སྲོང་ཆེན་པོ་མགོན་པོ་རྒྱལ་བར་དེར་འགྱུར་སྙམ། །
en: Be delighted, for today you will become a victor!

source: དགྱེས་སྐྱེད་ཤིང་དབང་དྲུང་གཤེགས་མི་བསྙེངས་བཞུགས་མཛོད་ལ། །
en: “ ‘Approach the lord of trees and sit there without fear.

source: བདུད་སྡེ་ཕམ་པར་མཛོད་དེ་ཉོན་མོངས་དྲ་བ་དྲོལ། །ཇི་ལྟར་སྔོན་གྱི་རྒྱལ་དབང་དེ་དག་སངས་རྒྱས་པ། །
en: Shake off the army of Māra and tear apart the net of afflictions.

source: དེ་ལྟར་བྱང་ཆུབ་རབ་མཆོག་ཞི་བ་འཚང་རྒྱར་མཛོད། །
en: Awaken to the calm, the supreme, the highest awakening, Just as the victors of the past were awakened.

source: གང་གི་དོན་དུ་ཁྱོད་ཀྱིས་བསྐལ་པ་བྱེ་མང་དུ། །
en: “ ‘The time has come for the fulfillment of your aspiration, The reason you have worked so many tens of millions of eons,

source: འགྲོ་བ་དག་ནི་དགྲོལ་ཕྱིར་དཀའ་བ་རྣམས་ཀྱང་སྤྱད། །ཁྱོད་ཀྱི་དགོངས་པ་དེ་རྫོགས་ཤིང་དབང་དྲུང་གཤེགས་ཏེ། །
en: Undertaking difficult deeds for the sake of freeing beings.

source: བྱང་ཆུབ་མཆོག་ལ་རེག་པར་མཛད་པའི་དུས་འདི་ལགས།། །།བམ་པོ་དྲུག་པ།
en: Sit beneath the lord of trees and touch the highest awakening.’

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀླུའི་རྒྱལ་པོ་ནག་པོའི་གནས་ནས་བྱུང་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་འགྲོ་བ་ན་ལམ་གྱི་གཡས་རོལ་ན་རྩྭ་འཚོང་བཀྲ་ཤིས་པ་ཞེས་བྱ་བ་རྩྭ་བརྔ་ཞིང་འདུག་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མངོན་དུ་ཕྱོགས་པ་མཐོང་སྟེ།
en: “At that point, Śāntamati, the Bodhisattva stepped out from the abode of the nāga king, Kālika, and approached the seat of awakening. As he approached the seat, on the right-hand side there was a grass seller named Svastika who was collecting grass.

source: ལྷ་རྣམས་ཀྱིས་བསྐུལ་ནས་རྩྭ་འཇམ་པ། ཤིན་ཏུ་གཞོན་པ། ཉམས་དགའ་བ། ཡིད་དགའ་བར་བྱེད་པ། རྨ་བྱའི་མགྲིན་པ་ལྟ་བུ་དགའ་བ་འཁྱིལ་པ། གཡས་སུ་འཁྱིལ་པ། ཁ་དོག་དང་ལྡན་པ།
en: He saw that the Bodhisattva was heading toward the seat of awakening, and, impelled by the gods, he gathered up a bundle of grass that was soft, tender, agreeable, attractive, curved like a peacock’s neck, spiraling nicely to the right, fragrant, and pleasant to touch like the down of the kācalindika bird.

source: དྲི་དང་ལྡན་པ། ཀཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བ་སྤར་གང་བླངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། རྩྭ་སྤར་གང་བྱང་ཆུབ་སེམས་དཔའ་ལ་བྱིན་ཏེ། བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: He took the bundle of grass, approached the Bodhisattva, and offered it to him with the ambition that he would conceive the aspiration for unsurpassable and perfect awakening.

source: ཞི་བའི་བློ་གྲོས་ཁྱོད་རྩྭ་འཚོང་བཀྲ་ཤིས་པ་མི་སྔ་མི་འཕྱི་བར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་རྩྭ་ཡང་བྱིན་ནོ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟའོ། །
en: “Now, Śāntamati, if one were to think that the grass seller Svastika had not previously given grass and conceived the aspiration for awakening, or that he had done so for the last time, one should not see it in that way.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་རྩྭ་འཚོང་བཀྲ་ཤིས་པའི་སྔོན་གྱི་སྨོན་ལམ་ཡིན་ཏེ། ཇི་ལྟར་ཁོ་བོ་བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཁྲི་ཤོམ་པ་བཞིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: For it was because of the previous vow made by the grass seller Svastika—namely, ‘I will be responsible for spreading out the mats upon the seat of awakening for all the bodhisattvas of this Fortunate Eon.’ Now, what was the cause of this?

source: ཞི་བའི་བློ་གྲོས་ཁོ་བོས་མངོན་པར་ཤེས་ཏེ། འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདིའི་སྔ་རོལ་བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: I know from first-hand experience, Śāntamati, that in the past, ninety-one eons before our Fortunate Eon, a realized one, a worthy one, a perfectly awakened buddha named Vipaśyin arose in the world.

source: འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: He was perfected in knowledge and conduct, a sublime one, a knower of the world, an unsurpassable trainer of those ready to be trained, a teacher of gods and humans, a blessed buddha.

source: དེའི་གསུང་རབ་ལ་དགེ་སློང་སྟོང་ཐམ་པ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་བཅོམ་ལྡན་འདས་དེས་ཁྱེད་ཅག་བསྐལ་པ་བཟང་པོ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཞེས་དེ་དག་ལུང་བསྟན་ཏོ། །
en: “While giving a teaching, he made a prediction for a group of one thousand monks who were leading the holy life with satisfaction.

source: དེའི་ཚེ་ན་ཁྱིམ་བདག་བློ་གྲོས་ལྡན་ཞེས་བྱ་བ་ཞིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས།
en: He said, ‘You will all awaken fully to unsurpassable and perfect awakening during the Fortunate Eon.’ At that time, there was a householder sitting in that very assembly whose name was Matimat.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལུང་བསྟན་པ་དེ་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། འདི་སྐད་དུ་བསྐལ་པ་བཟང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་ན་སེང་གེའི་ཁྲི་བྱི་དོར་བྱའོ། །ཞེས་སྨོན་ལམ་བཏབ་བོ། །
en: When he heard the prediction made on behalf of those bodhisattvas as he was sitting there, he conceived the aspiration for unsurpassable and perfect awakening, and made this vow: ‘I will prepare the lion’s seat for those realized ones of the Fortunate Eon as they are going to the seat of awakening.’

source: ཞི་བའི་བློ་གྲོས་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་བློ་གྲོས་ལྡན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཚོམ་ཟ་བའམ། ཡིད་གཉིས་སུ་གྱུར་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: “Now again, Śāntamati, if one were to have the doubt, the differing opinion, or the question that perhaps the person who was the householder Matimat at that moment and time was someone else, one should not see it in that way.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྩྭ་འཚོང་བཀྲ་ཤིས་པ་འདི་དེའི་ཚེ་དེའི་དུས་ན་ཁྱིམ་བདག་བློ་གྲོས་ལྡན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: That is because the grass seller Svastika was at that moment and time the householder named Matimat.

source: ཞི་བའི་བློ་གྲོས་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་རྩྭ་འཚོང་བཀྲ་ཤིས་པའི་སྔོན་གྱི་སྨོན་ལམ་འདི་ལྟར་རིག་པར་བྱ་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་ཇི་ལྟ་བ་དང་། དབང་པོ་ཡོངས་སུ་སྨིན་པ་ཇི་ལྟ་བུ་བཞིན་དུ་དེ་ཁ་ཅིག་ལ་ནི་རྩྭ་སྤར་གང་འབུལ་བར་འགྱུར། ཁ་ཅིག་ལ་ནི་རིན་པོ་ཆེ་བཀོད་པའི་སེང་གེའི་ཁྲི་འབུལ་བར་འགྱུར་རོ། །ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་ཤིང་དྲུང་དུ་སོང་བ་དང་།
en: Furthermore, Śāntamati, in this very same manner you should understand the previous vow of the grass seller Svastika to be such that he gives a bunch of grass to some of the bodhisattvas and he presents some bodhisattvas with lion’s seats set with splendid arrays of jewels, according to the motivations of beings and according to the degree of maturity of their spiritual faculties.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་ལྷ་རྣམས་ལྷའི་བུ་མོ་མེ་ཏོག་གི་སྐོན་བུ་ཐོགས་པ་དང་། སྤོས་དང་། ཕྱེ་མའི་ཕུར་མ་ཐོགས་པ་ཁྲི་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: “At that point, Śāntamati, as the Bodhisattva arrived at the seat of awakening, which was at the base of the tree of awakening, the deity of the tree of awakening approached the Bodhisattva together with a thousand divine girls from the ten directions who were holding bouquets of flowers as well as incense, powders, and scented oils.

source: བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཇི་ལྟར་ཐོགས་པའི་མེ་ཏོག་དང་། ཕྱེ་མ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་གཏོར་ཏེ།
en: Once they had approached the Bodhisattva, they bowed their heads at his feet and scattered the flowers, incense, powders, and scented oils that they had brought all around the Bodhisattva.

source: ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: Then they praised him with these verses:

source: བདག་ཉིད་ཆེན་པོ་མི་བསྙེངས་དཔའ་ཞིང་དུལ་ཞི་བ། །དགྱེས་ཤིང་ཚིམ་པ་བརྟན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘Homage to you, Magnanimous One; to you, fearless, steady, calm one; To you, disciplined, delighted, contented, and brilliant one;

source: འབར་བ་ཉམས་དགྱེས་ཁ་ན་མ་ཐོ་མི་མངའ་བ། །
en: To you, the one who brings happiness;

source: སྐྱོན་ལས་གྲོལ་བའི་སྟོན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: to you, blameless one; To you who are liberated from faults. Homage to you, Teacher.

source: སྡུག་བསྔལ་ཆེན་པོར་བྱིང་བ་མགོན་མེད་འགྲོ་འདི་ལ། །ཁྱོད་ནི་བདེ་བ་རབ་ཏུ་སྩོལ་བའི་མགོན་པོ་གཅིག །
en: “ ‘Homage to you, the one and only source of help

source: འགྲོ་བའི་ཉོན་མོངས་ནད་རྣམས་སྤང་བའི་ཕྱིར་བྱུང་བ། །
en: Who bestows happiness on helpless folk mired in great suffering.

source: སྨན་པའི་རྒྱལ་ཆེན་གྲགས་ལྡན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, illustrious king of the physician-kings, Who rids the world of the illnesses that are the afflictions.

source: ཇི་ལྟར་ལྷ་ཚོགས་དད་ཅིང་རབ་ཏུ་དགའ་བ་ཡིས། །
en: “ ‘Just as sure as congregations of gods, faithful and delighted,

source: ལྷ་ཡི་མེ་ཏོག་ཆར་པ་རབ་ཏུ་འབེབས་པ་ལས། །
en: Have rained down showers of heavenly flowers upon you,

source: བདུད་དག་སྡེ་དང་བཅས་པ་བྱམས་པས་བཅོམ་ནས་ནི། །
en: In the same way, once you have defeated Māra with love,

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་དམ་པ་དེ་རིང་བརྙེས་སུ་ངེས། །
en: You are certain to attain the supreme awakening today.

source: ཤིང་དབང་དྲུང་དུ་གཤེགས་ཏེ་ཁྲི་དེར་བཞུགས་ནས་སུ། །
en: “ ‘Approach the lord of trees and sit down upon this seat.

source: བདུད་བཏུལ་ནས་ནི་མུན་པ་ཐམས་ཅད་གཞོམ་པར་མཛོད། །
en: Once you defeat Māra, all the darkness will dissipate.

source: ཇི་ལྟར་སྔོན་གྱི་ཐུབ་དབང་དེ་དག་སངས་རྒྱས་པ། །དེ་ལྟར་བྱང་ཆུབ་ཞི་བ་མཆོག་རབ་འཚང་རྒྱར་མཛོད། །
en: You will awaken to that calm, supreme, highest awakening, Just as those lordly sages of the past were awakened.

source: ཇི་ལྟར་ཁྱོད་ཀྱིས་འགྲོ་བ་དགྲོལ་བའི་དོན་དུ་ནི། །
en: “ ‘Just as you have become purified for the sake of freeing the world

source: བསྐལ་པ་བྱེ་བར་དཀའ་མཛད་རྣམ་པར་དག་འགྱུར་བ། །
en: Through your completion of difficult deeds for tens of millions of eons,

source: དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ཀྱི་དགོངས་མཆོག་དེང་རྫོགས་ཀྱིས། །
en: In the same way, Great Seer, your supreme ambition has reached completion.

source: ཤིང་དབང་དྲུང་དུ་བཞུགས་ཏེ་བྱང་ཆུབ་འཚང་རྒྱར་མཛོད། །
en: Today, beneath the lord of trees, you will awaken to awakening.’

source: ཞི་བའི་བློ་གྲོས་དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རྩྭ་སྤར་གང་ཁྱེར་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: “At that point, Śāntamati, the Bodhisattva came to the seat of awakening carrying the bundle of grass, which he spread out as his very own seat of grass at the base of the tree of awakening.

source: བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བདག་ཉིད་ཀྱིས་རྩྭའི་གདིང་བ་བཏིང་ནས་བྱང་ཆུབ་ཀྱི་ཤིང་ལ་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་སོ། །
en: He then bowed down to the tree of awakening and walked around it seven times, keeping it on his right.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་རྩྭའི་གདིང་བ་བཏིང་མ་ཐག་ཏུ་དེ་ནས་ལྷའི་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་སེང་གེའི་ཁྲི་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ།
en: Just as soon as the Bodhisattva had spread out his seat of grass, Śāntamati, eighty-four thousand deities also prepared eighty-four thousand lion’s seats for the Bodhisattva.

source: མཐོ་བ།
en: These seats were multicolored, beautiful to behold, tall, and lofty.

source: ཡངས་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། རིན་པོ་ཆེའི་ཁ་ཁྱེར་ཅན། རིན་པོ་ཆེའི་དྲ་བས་གཡོགས་པ། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་བྲེས་པ།
en: They were entirely studded with jewels, raised upon jeweled daises, covered by jeweled nets, and draped with nets that had tiny bells woven into them.

source: མུ་ཏིག་གི་རྒྱན་ཕྲེང་རབ་ཏུ་སྦྱངས་པ་རས་བཅོས་བུ་བརྒྱ་སྟོང་དུ་མ་བཏིང་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་བྱང་ཆུབ་སེམས་དཔའི་ཆེད་དུ་བཤམས་སོ། །
en: The seats had strands of pearls hung on them, and they were arranged upon several thousand bolts of cloth.

source: ཞི་བའི་བློ་གྲོས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཁྲི་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་ཐམས་ཅད་ལ་བདག་ཉིད་འདུག་པར་ཀུན་ཏུ་བསྟན་པར་གྱུར་ཏོ། །
en: Śāntamati, the Bodhisattva then displayed himself seated upon each and every one of those eighty-four thousand lion’s seats.

source: ལྷའི་བུ་དེ་དག་གིས་ཀྱང་གཞན་དང་གཞན་དུ་མི་མཐོང་མི་ཤེས་ཏེ།
en: Yet, the deities did not see each other. They were not aware of each other.

source: ལྷའི་བུ་རེ་རེས་ཀྱང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་གི་སེང་གེའི་ཁྲི་ལ་བཞུགས་སོ། །
en: Rather, each and every deity knew only this: ‘The Bodhisattva is seated upon my lion’s seat.

source: བདག་གི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བར་ཤེས་ཏེ། དེ་དག་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Seated upon my lion’s seat, he will awaken to unsurpassable, perfect awakening.’ As a result of the joy and pleasure they felt at this very thought, they all became unable to be turned back from unsurpassable, perfect awakening.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་གཉིས་པའོ།། །།
en: This was the twelfth chapter, “The Journey to the Seat of Awakening.”

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཁྲི་དེ་ལ་འདུག་མ་ཐག་ཏུ་དེ་ནས་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུའི་བར་ནས་བདུད་བསྐུལ་བ་ཞེས་བྱ་བའི་འོད་ཕྱུང་སྟེ་འོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་འཁོད་པའི་བདུད་བྱེ་བ་ཕྲག་བཞི་བརྒྱ་ལ་རེག་གོ། །
en: Chapter 13: The Taming of the Māras “Just as soon as the Bodhisattva took his seat upon the lion’s seat, Śāntamati, a ray of light issued from the tuft of hair between his eyebrows.

source: འོད་དེས་དེ་དག་ལ་རེག་མ་ཐག་ཏུ་རང་རང་གི་གནས་ན་འཁོད་བཞིན་དུ་སྤུ་ཟིང་ཞེས་བྱེད་དེ།
en: This light is called challenging Māra, and it reached a billion māras throughout the cosmos of a billion worlds and touched each of them in their respective abodes, which immediately gave them goose bumps.

source: རང་གི་བདུད་ཀྱི་གནས་ཚིག་ཅིང་མོག་མོག་པོར་གྱུར་པར་ཤེས་ནས་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When they realized that their abodes were being consumed by the light and made dim in comparison, they thought to themselves, ‘What is the cause of this?

source: གང་གི་ཕྱིར་གནས་འདི་དག་མོག་མོག་པོར་གྱུར་པར་སྣང་བ་འདི་ལ་རྒྱུ་ནི་ཅི་ཞིག་ཡོད་རྐྱེན་ནི་ཅི་ཞིག་ཡོད།
en: For what reason have these abodes seemingly been made dim?

source: བྱང་ཆུབ་སེམས་དཔའ་འམ་ཅིག་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འདུག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་གྲང་སྙམ་སྟེ། རྣམ་པར་བལྟས་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པར་མཐོང་ངོ་། །
en: Could it not be that a bodhisattva is seated on the seat of awakening and is awakening to unsurpassable, perfect awakening?’ Looking down, they saw that the Bodhisattva was seated at the seat of awakening.

source: དེ་ནས་བདུད་སྡིག་ཅན་དེ་དག་རང་རང་གི་གནས་ནས་མི་སྣང་བར་གྱུར་ནས་བདུད་རེ་རེ་ཡང་གནོད་སྦྱིན་ཁ་དོག་རྣམ་པ་མང་པོ་དང་།
en: “At that point, each and every one of those evil māras vanished from their respective abodes.

source: ཆ་བྱད་རྣམ་པ་མང་པོ་དང་།
en: Each and every māra was surrounded by immeasurable, incalculable hundreds of thousands of millions and billions of yakṣas.

source: དབྱིབས་རྣམ་པ་མང་པོ་དང་། ཆུ་ཞེང་རྣམ་པ་མང་པོ་དང་། གཡོ་བ་རྣམ་པ་མང་པོ་དང་། མགོ་རྣམ་པ་མང་པོ་དང་།
en: The yakṣas had various complexions, various disguises, various appearances, various heights, various turbans, and various heads.

source: མཚོན་ཆ་རྣམ་པ་མང་པོ་དང་། རྒྱལ་མཚན་རྣམ་པ་མང་པོ་ཐོགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དག་གིས་བསྐོར་ཏེ། སྨྲ་བ་རྣམ་པ་མང་པོ་སྨྲ་ཞིང་བདུད་ཀྱི་མཐུ་ཆེན་པོ་དང་།
en: The yakṣas were carrying various weapons and various victory banners.

source: བདུད་ཀྱི་རྫུ་འཕྲུལ་ཆེན་པོས་བདུད་རེ་རེས་ཀྱང་བདུད་ཀྱི་འཁོར་གྱིས་རྒྱར་དཔག་ཚད་ཉི་ཁྲི་ཉི་ཁྲི་སྟེ། ཁོར་ཡུག་ཏུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་བཀང་ནས་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་དོང་ངོ་། །ཞི་བའི་བློ་གྲོས་འཁོར་ཆེན་པོ་དེ་དག་དོང་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་ཡིད་དུ་མི་འོང་བ། མཉན་པར་མི་འོས་པ། མི་སྙན་པ། ཨུ་དུག་ཅེས་བྱ་བ་དང་། པི་ཙིག་ཅེས་བྱ་བ་དང་། ཧུ་ལུ་ཧུ་ལུ་ཞེས་བྱ་བ་དང་། རྒྱོབ་ཤིག །
en: Uttering various expressions, and with the great majestic power of a māra and the great superhuman power of a māra, each and every māra approached the tree of awakening so that māras extended for twenty thousand leagues and the māras’ assembly extended for more than eighty-four thousand leagues.

source: ཟུང་ཤིག །སོད་ཅིག །ཆིངས་ཤིག་ཅེས་བྱ་བའི་སྒྲ་ཆེན་པོ་དེ་ལྟ་བུ་ཕྱུང་བར་གྱུར་ཏོ། །གལ་ཏེ་འདོད་ཆགས་དང་མ་བྲལ་བའི་སེམས་ཅན་རྣམས་ཀྱིས་སྒྲ་དེ་ཐོས་ལ། ཞི་བའི་བློ་གྲོས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་སྒྲ་དེ་མི་གྲག་པར་མ་བྱས་ན་ནི་དེ་དག་ཁ་ནས་ཁྲག་དྲོན་པོ་སྐྱུག་ཅིང་འཆི་བ་འམ།
en: “Just as soon as this assembly of māras arrived, Śāntamati, at that moment they raised a great din of unpleasant, offensive, and unsavory sounds, like ‘Ooduk!’ ‘Pijik!’ ‘Huluhulu!’—that is, ‘Seize him!’ ‘Beat him!’ ‘Bind him!’ If those beings who were not yet free from passion were to have heard that din, they would have vomited hot blood and died, or they would have experienced the suffering of simply dying right away—that is, Śāntamati, unless the Bodhisattva were to conceal that noise from them.

source: ཤི་ལ་ཐུག་པའི་སྡུག་བསྔལ་ཆེན་པོ་རྙེད་པར་འགྱུར་རོ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོས་ནོན་པས་སེམས་ཅན་ལ་རྣམ་པར་འཚེ་བར་འགྱུར་དུ་འོང་ངོ་ཞེས་སྒྲ་དེ་མི་གྲག་པར་བྱས་པར་གྱུར་ཏོ། །
en: Consequently, the Bodhisattva was seized by a feeling of great compassion at that moment, and so he concealed that sound, saying, ‘May this sound not harm beings!

source: ཞི་བའི་བློ་གྲོས་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐབས་ལ་མཁས་པའི་ཡུལ་ཡིན་ནོ། །
en: May it not kill them!’ This, Śāntamati, is the scope of a bodhisattva’s mastery of skill in means.

source: ཞི་བའི་བློ་གྲོས་སྒྲ་དེ་ལྟ་བུ་དེ་ཐོས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐ་ན་སྤུ་གཡོས་པར་ཡང་མ་གྱུར་ཏོ། །
en: Moreover, Śāntamati, even though he heard the noise, not even a single hair on the Bodhisattva’s body stood on end.

source: སྒྲ་འདི་ཐམས་ཅད་བྲག་ཆ་དང་མཚུངས་པར་ལེགས་པར་རྟོགས་པའི་ཕྱིར་རོ། །
en: The reason is that he had completely understood that all sounds are just like echoes, including that noise too.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་ཀྱི་བསྙེན་བཀུར་བའི་ལྷ་རྣམས་ཀྱིས་བདུད་ལྷགས་པར་རིག་ནས་བདུད་སྡིག་ཅན་དེ་དག་ལ་བཟློག་པ་རྣམ་པ་བཅུ་དྲུག་གིས་ཟློག་པར་བྱེད་དེ།
en: “Once the deities who attended upon the tree of awakening became aware of the arrival of the assembly of māras, Śāntamati, they sought to dissuade the evil māras with sixteen different forms of dissuasion.

source: སྡིག་ཅན་དག་ཕོངས་པར་འགྱུར་བ་གདོན་པར་དཀའ་བ་རྣམ་པ་འདི་ལྟ་བུ་འདི་དག་གིས་ཅི་ཞིག་བྱས་ཐོང་ཤིག །
en: ‘Enough, evil ones,’ they said. ‘What is the use of your putting so much effort and difficulty into making trouble in this way?

source: སྡིག་ཅན་ཁྱེད་ནི་གྱད་སྟོབས་ཆུང་ངུ་ལ་གྱད་སྟོབས་ཆེན་པོ་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་བརྡབས་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to strike you down just like a great wrestler strikes down a much inferior wrestler.

source: སྡིག་ཅན་ཁྱེད་ནི་དཔའ་བོ་ཆེན་པོས་ཕ་རོལ་གྱི་སྡེ་བཅོམ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་ཕམ་པར་བྱས་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to defeat you just like a great hero defeats an army of opponents.

source: སྡིག་ཅན་ཁྱེད་ནི་སྲིན་བུ་མེ་ཁྱེར་ལ་ཟླ་བའི་དཀྱིལ་འཁོར་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to overpower you just like the full moon overpowers a firefly.

source: སྡིག་ཅན་ཁྱེད་ནི་ཕུབ་མ་སྤར་གང་ལ་རླུང་མར་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་གཏོར་བར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to blow you away like a strong wind blows away a bundle of straw.

source: སྡིག་ཅན་ཁྱེད་ནི་ཤིང་སཱ་ལ་ཆེན་པོ་རྩ་བ་ནས་ཆད་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་སྒྱེལ་བར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to fell you as if you were a great sāla tree cut down at the roots.

source: སྡིག་ཅན་ཁྱེད་ནི་རི་དགས་ཀྱི་ཚོགས་ལ་སེང་གེ་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་དངངས་པར་བྱས་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to terrify you like only a great-maned lion can terrify a herd of deer.

source: སྡིག་ཅན་ཁྱེད་ནི་བརྗེས་ཀྱི་ཆུ་ལ་ཉི་ཚན་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་ཟད་པར་བྱས་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to evaporate you like the heat of the sun evaporates water in the hoofprint of a cow.
